app/controllers/inscriptions_controller.rb

  def create
    Registration.create(registration_params)
---
INSERT INTO "registrations" ("first_name", "last_name", "email", "university", "dni", "city", "province", "country", "category", "course", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"